[
  {
    "id": "style-oversized-tees",
    "title": "How to Style Oversized Tees Without Looking Messy",
    "description": "Oversized tees are a streetwear staple, but styling them incorrectly can look sloppy. Learn the ultimate tips and tricks to wear oversized tees with confidence.",
    "date": "2024-11-22",
    "readTime": "7 min",
    "cover": "/images/blog/oversized-tees.jpg",
    "content": "<p>Oversized tees are a cornerstone of streetwear fashion. They are comfortable, versatile, and can be styled in countless ways — but many struggle to make them look intentional rather than sloppy.</p><h2>1. Balance Your Silhouette</h2><p>Pair an oversized tee with slim or tapered pants. This contrast keeps your outfit proportional. Avoid pairing with overly baggy bottoms unless you're going for a full streetwear vibe.</p><h2>2. Tuck, Knot, or Layer</h2><p>Front-tucking your tee slightly into your jeans or shorts can create shape. Knotting on the side adds a feminine or edgy flair. Layer oversized tees over long-sleeve tops or under jackets for a high-fashion layered look.</p><h2>3. Accessorize Smartly</h2><p>Caps, chains, or a clean pair of sneakers elevate your oversized tee outfit. Avoid cluttering — one or two statement pieces are enough.</p><h2>4. Mind the Length</h2><p>The tee should cover part of your hips but not completely swamp your frame. Experiment with different sizes until you find the perfect fit.</p><h2>5. Colors and Prints</h2><p>Neutral oversized tees are versatile, while graphic prints can make a statement. Match your shoes and accessories with the color palette for a cohesive look.</p><p>By following these tips, oversized tees can become your favorite wardrobe staple without looking messy. Confidence is the final touch — wear it boldly!</p>"
  },
  {
    "id": "style-oversized-tees",
    "title": "How to Style Oversized Tees Without Looking Messy",
    "description": "Oversized tees are effortless — until they aren’t. Learn how to style them perfectly.",
    "date": "2024-11-22",
    "readTime": "5 min",
    "cover": "/images/blog/oversized-tees.jpg",
    "content": "<p>Oversized tees are effortless — until they aren’t...</p>"
  },
  {
    "id": "why-vintage-is-worth-it",
    "title": "Why Vintage Clothing Is Worth It",
    "description": "Understanding the value of vintage fashion and timeless pieces.",
    "date": "2024-11-18",
    "readTime": "6 min",
    "cover": "/images/blog/vintage.jpg",
    "content": "<p>Vintage clothing has history, character...</p>"
  },
  {
    "id": "thrift-shopping-mistakes",
    "title": "5 Common Thrift Shopping Mistakes",
    "description": "Avoid these mistakes to get the best finds every time you thrift.",
    "date": "2024-11-21",
    "readTime": "4 min",
    "cover": "/images/blog/mistakes.jpg",
    "content": "<p>Thrifting can be tricky if you don’t know the rules...</p>"
  }
]